# Pandas
## Series

In [1]:
import numpy as np
import pandas as pd

In [6]:
lst = [i**2 for i in range(10)]

In [7]:
pd.Series(lst)

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

In [8]:
number_names = ["zero", "one", "two", "three", "four", "five", "six", "seven", "eight", "nine"]

In [10]:
pd.Series(lst, number_names)

zero      0
one       1
two       4
three     9
four     16
five     25
six      36
seven    49
eight    64
nine     81
dtype: int64

In [11]:
np_arr = np.arange(0,10,2)

In [12]:
pd.Series(np_arr)

0    0
1    2
2    4
3    6
4    8
dtype: int64

In [13]:
dictionary = {"a":1, "b":2, "c":3}

In [14]:
pd.Series(dictionary)

a    1
b    2
c    3
dtype: int64

## Calculation with series

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {"apples":3, "pears":2, "bananas": 1}
dict2 = {"apples":5, "bananas":2, "grapes":10}

In [3]:
fruit_series = pd.Series(dict1)
fruit_series2 = pd.Series(dict2)

In [4]:
fruit_series

apples     3
pears      2
bananas    1
dtype: int64

In [5]:
fruit_series2

apples      5
bananas     2
grapes     10
dtype: int64

In [6]:
fruit_series + fruit_series2

apples     8.0
bananas    3.0
grapes     NaN
pears      NaN
dtype: float64

## DataFrames

### Create random DataFrame

In [18]:
cols = ["Cars", "Horses", "Bicycles", "Flowers", "Electricity"]
rows = ["Germany", "USA", "France", "Italy", "China"]

In [73]:
data = np.random.randint(1,10000,(5,5))
data

array([[ 317, 5429, 9273, 8163, 3043],
       [3866,   28, 6019, 9709, 9020],
       [6788, 3498, 1498, 2156, 1883],
       [ 779, 5888, 7990, 7024, 5540],
       [ 710, 7861, 7929, 7099, 6309]])

In [74]:
countries_df = pd.DataFrame(data, index = rows, columns = cols)

In [75]:
countries_df

         Cars  Horses  Bicycles  Flowers  Electricity
Germany   317    5429      9273     8163         3043
USA      3866      28      6019     9709         9020
France   6788    3498      1498     2156         1883
Italy     779    5888      7990     7024         5540
China     710    7861      7929     7099         6309

### Accessing values

In [76]:
countries_df["Cars"]

Germany     317
USA        3866
France     6788
Italy       779
China       710
Name: Cars, dtype: int64

In [77]:
countries_df[["Cars", "Bicycles"]]

         Cars  Bicycles
Germany   317      9273
USA      3866      6019
France   6788      1498
Italy     779      7990
China     710      7929

In [78]:
countries_df[["Cars"]]

         Cars
Germany   317
USA      3866
France   6788
Italy     779
China     710

In [81]:
countries_df.loc["USA"]

Cars           3866
Horses           28
Bicycles       6019
Flowers        9709
Electricity    9020
Name: USA, dtype: int64

In [80]:
countries_df.loc[["USA"]]

     Cars  Horses  Bicycles  Flowers  Electricity
USA  3866      28      6019     9709         9020

In [83]:
countries_df.loc[["Germany", "France", "Italy"]]

         Cars  Horses  Bicycles  Flowers  Electricity
Germany   317    5429      9273     8163         3043
France   6788    3498      1498     2156         1883
Italy     779    5888      7990     7024         5540

In [84]:
countries_df

         Cars  Horses  Bicycles  Flowers  Electricity
Germany   317    5429      9273     8163         3043
USA      3866      28      6019     9709         9020
France   6788    3498      1498     2156         1883
Italy     779    5888      7990     7024         5540
China     710    7861      7929     7099         6309

### Creating new columns

In [85]:
countries_df["Transportation"] = countries_df["Cars"] + countries_df["Bicycles"]

In [86]:
countries_df

         Cars  Horses  Bicycles  Flowers  Electricity  Transportation
Germany   317    5429      9273     8163         3043            9590
USA      3866      28      6019     9709         9020            9885
France   6788    3498      1498     2156         1883            8286
Italy     779    5888      7990     7024         5540            8769
China     710    7861      7929     7099         6309            8639

### Deleting data

In [89]:
countries_df["Random_Merit"] = countries_df["Cars"] * countries_df["Bicycles"]

In [90]:
countries_df

,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Random_Merit
Germany,317,5429,9273,8163,3043,9590,2939541
USA,3866,28,6019,9709,9020,9885,23269454
France,6788,3498,1498,2156,1883,8286,10168424
Italy,779,5888,7990,7024,5540,8769,6224210
China,710,7861,7929,7099,6309,8639,5629590

In [94]:
countries_df.drop("Random_Merit", axis=1, inplace=True)

In [95]:
countries_df

         Cars  Horses  Bicycles  Flowers  Electricity  Transportation
Germany   317    5429      9273     8163         3043            9590
USA      3866      28      6019     9709         9020            9885
France   6788    3498      1498     2156         1883            8286
Italy     779    5888      7990     7024         5540            8769
China     710    7861      7929     7099         6309            8639

### Advanced (conditional) selecting

In [97]:
countries_df[countries_df["Electricity"]>4000]

       Cars  Horses  Bicycles  Flowers  Electricity  Transportation
USA    3866      28      6019     9709         9020            9885
Italy   779    5888      7990     7024         5540            8769
China   710    7861      7929     7099         6309            8639

In [103]:
countries_df[(countries_df["Flowers"]<9000) & (countries_df["Electricity"]>4000)]

       Cars  Horses  Bicycles  Flowers  Electricity  Transportation
Italy   779    5888      7990     7024         5540            8769
China   710    7861      7929     7099         6309            8639

### Working with the index

In [106]:
countries_df.reset_index(inplace=True)
countries_df

     index  Cars  Horses  Bicycles  Flowers  Electricity  Transportation
0  Germany   317    5429      9273     8163         3043            9590
1      USA  3866      28      6019     9709         9020            9885
2   France  6788    3498      1498     2156         1883            8286
3    Italy   779    5888      7990     7024         5540            8769
4    China   710    7861      7929     7099         6309            8639

In [110]:
countries_df.rename({"index":"Countries"}, axis=1, inplace=True)
countries_df

  Countries  Cars  Horses  Bicycles  Flowers  Electricity  Transportation
0   Germany   317    5429      9273     8163         3043            9590
1       USA  3866      28      6019     9709         9020            9885
2    France  6788    3498      1498     2156         1883            8286
3     Italy   779    5888      7990     7024         5540            8769
4     China   710    7861      7929     7099         6309            8639

### Multiple DataFrames

In [133]:
cols = ["Bananas", "Apples"]
rows = ["Germany", "USA", "Ghana", "New Zealand"]
data = np.random.randint(1,1000000,(4,2))

In [134]:
countries_df2 = pd.DataFrame(data, columns=cols, index=rows).reset_index().rename({"index":"Countries"}, axis=1)
countries_df2

     Countries  Bananas  Apples
0      Germany   792738  233463
1          USA   855342  267340
2        Ghana   270960  532424
3  New Zealand   701745  611670

#### Merging

In [128]:
pd.merge(countries_df, countries_df2, on="Countries", how="inner")

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
0,Germany,317,5429,9273,8163,3043,9590,129295,23939
1,USA,3866,28,6019,9709,9020,9885,967969,907253

In [143]:
outer_merge_df = pd.merge(countries_df, countries_df2, on="Countries", how="outer")
outer_merge_df

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
0,Germany,317.0,5429.0,9273.0,8163.0,3043.0,9590.0,792738.0,233463.0
1,USA,3866.0,28.0,6019.0,9709.0,9020.0,9885.0,855342.0,267340.0
2,France,6788.0,3498.0,1498.0,2156.0,1883.0,8286.0,NaN,NaN
3,Italy,779.0,5888.0,7990.0,7024.0,5540.0,8769.0,NaN,NaN
4,China,710.0,7861.0,7929.0,7099.0,6309.0,8639.0,NaN,NaN
5,Ghana,NaN,NaN,NaN,NaN,NaN,NaN,270960.0,532424.0
6,New Zealand,NaN,NaN,NaN,NaN,NaN,NaN,701745.0,611670.0

#### Missing Data

In [152]:
countries_df_large = outer_merge_df.fillna(outer_merge_df.mean())
countries_df_large

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
0,Germany,317.0,5429.0,9273.0,8163.0,3043.0,9590.0,792738.00,233463.00
1,USA,3866.0,28.0,6019.0,9709.0,9020.0,9885.0,855342.00,267340.00
2,France,6788.0,3498.0,1498.0,2156.0,1883.0,8286.0,655196.25,411224.25
3,Italy,779.0,5888.0,7990.0,7024.0,5540.0,8769.0,655196.25,411224.25
4,China,710.0,7861.0,7929.0,7099.0,6309.0,8639.0,655196.25,411224.25
5,Ghana,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,270960.00,532424.00
6,New Zealand,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,701745.00,611670.00

In [151]:
outer_merge_df.fillna(value={"Bananas":600000, "Apples":400000}).dropna()

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
0,Germany,317.0,5429.0,9273.0,8163.0,3043.0,9590.0,792738.0,233463.0
1,USA,3866.0,28.0,6019.0,9709.0,9020.0,9885.0,855342.0,267340.0
2,France,6788.0,3498.0,1498.0,2156.0,1883.0,8286.0,600000.0,400000.0
3,Italy,779.0,5888.0,7990.0,7024.0,5540.0,8769.0,600000.0,400000.0
4,China,710.0,7861.0,7929.0,7099.0,6309.0,8639.0,600000.0,400000.0

#### ... and merge again

In [129]:
pd.merge(countries_df, countries_df2, on="Countries", how="left")

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
0,Germany,317,5429,9273,8163,3043,9590,129295.0,23939.0
1,USA,3866,28,6019,9709,9020,9885,967969.0,907253.0
2,France,6788,3498,1498,2156,1883,8286,NaN,NaN
3,Italy,779,5888,7990,7024,5540,8769,NaN,NaN
4,China,710,7861,7929,7099,6309,8639,NaN,NaN

In [130]:
pd.merge(countries_df, countries_df2, on="Countries", how="right")

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
0,Germany,317.0,5429.0,9273.0,8163.0,3043.0,9590.0,129295,23939
1,USA,3866.0,28.0,6019.0,9709.0,9020.0,9885.0,967969,907253
2,Ghana,NaN,NaN,NaN,NaN,NaN,NaN,913918,323985
3,New Zealand,NaN,NaN,NaN,NaN,NaN,NaN,173012,981176

#### Concatenation

In [132]:
cols = ["Bananas", "Apples"]
rows = ["Denmark", "Canada", "South Africa", "Austrialia"]
data = np.random.randint(1,1000000,(4,2))
countries_df3 = pd.DataFrame(data, columns=cols, index=rows).reset_index().rename({"index":"Countries"}, axis=1)
countries_df3

      Countries  Bananas  Apples
0       Denmark   623177  142117
1        Canada   333256  399512
2  South Africa   559043  601117
3    Austrialia   955841  900749

In [135]:
countries_df2

     Countries  Bananas  Apples
0      Germany   792738  233463
1          USA   855342  267340
2        Ghana   270960  532424
3  New Zealand   701745  611670

In [140]:
pd.concat([countries_df2, countries_df3]).reset_index(drop=True)

      Countries  Bananas  Apples
0       Germany   792738  233463
1           USA   855342  267340
2         Ghana   270960  532424
3   New Zealand   701745  611670
4       Denmark   623177  142117
5        Canada   333256  399512
6  South Africa   559043  601117
7    Austrialia   955841  900749

### GroupBy

In [154]:
countries_df_large

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
0,Germany,317.0,5429.0,9273.0,8163.0,3043.0,9590.0,792738.00,233463.00
1,USA,3866.0,28.0,6019.0,9709.0,9020.0,9885.0,855342.00,267340.00
2,France,6788.0,3498.0,1498.0,2156.0,1883.0,8286.0,655196.25,411224.25
3,Italy,779.0,5888.0,7990.0,7024.0,5540.0,8769.0,655196.25,411224.25
4,China,710.0,7861.0,7929.0,7099.0,6309.0,8639.0,655196.25,411224.25
5,Ghana,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,270960.00,532424.00
6,New Zealand,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,701745.00,611670.00

In [156]:
countries_df_large["continent"] = ["Europe", "North America", "Europe", "Europe", "Asia", "Africa", "Oceania"]

In [157]:
countries_df_large

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples,continent
0,Germany,317.0,5429.0,9273.0,8163.0,3043.0,9590.0,792738.00,233463.00,Europe
1,USA,3866.0,28.0,6019.0,9709.0,9020.0,9885.0,855342.00,267340.00,North America
2,France,6788.0,3498.0,1498.0,2156.0,1883.0,8286.0,655196.25,411224.25,Europe
3,Italy,779.0,5888.0,7990.0,7024.0,5540.0,8769.0,655196.25,411224.25,Europe
4,China,710.0,7861.0,7929.0,7099.0,6309.0,8639.0,655196.25,411224.25,Asia
5,Ghana,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,270960.00,532424.00,Africa
6,New Zealand,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,701745.00,611670.00,Oceania

In [160]:
countries_df_large.groupby("continent").max()

,Countries,Cars,Horses,Bicycles,Flowers,Electricity,Transportation,Bananas,Apples
continent,,,,,,,,,
Africa,Ghana,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,270960.00,532424.00
Asia,China,710.0,7861.0,7929.0,7099.0,6309.0,8639.0,655196.25,411224.25
Europe,Italy,6788.0,5888.0,9273.0,8163.0,5540.0,9590.0,792738.00,411224.25
North America,USA,3866.0,28.0,6019.0,9709.0,9020.0,9885.0,855342.00,267340.00
Oceania,New Zealand,2492.0,4540.8,6541.8,6830.2,5159.0,9033.8,701745.00,611670.00

## Read Data

In [161]:
iris_df = pd.read_csv("Data/IRIS.csv")

In [164]:
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [170]:
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [171]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [173]:
iris_sepal_df = iris_df[["sepal_length", "sepal_width", "species"]]
iris_sepal_df

     sepal_length  sepal_width    species
0             5.1          3.5     setosa
1             4.9          3.0     setosa
2             4.7          3.2     setosa
3             4.6          3.1     setosa
4             5.0          3.6     setosa
..            ...          ...        ...
145           6.7          3.0  virginica
146           6.3          2.5  virginica
147           6.5          3.0  virginica
148           6.2          3.4  virginica
149           5.9          3.0  virginica

[150 rows x 3 columns]

In [175]:
iris_sepal_df.to_csv("Data/SEPAL.csv")

In [184]:
iris_sepal_read_df = pd.read_csv("Data/SEPAL.csv", index_col=0, delimiter=",")

In [185]:
iris_sepal_read_df.head()

   sepal_length  sepal_width species
0           5.1          3.5  setosa
1           4.9          3.0  setosa
2           4.7          3.2  setosa
3           4.6          3.1  setosa
4           5.0          3.6  setosa